app/controllers/categorizations_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "categorizations" WHERE ("categorizations"."id" = 18)
---
	def show
		@category = Category.find(params[:category_id])
		@categorization = Categorization.find(params[:id])

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "websites" WHERE ("websites"."id" = 1)
INSERT INTO "categorizations" ("position", "created_at", "website_id", "updated_at", "category_id") VALUES(1, '2010-08-19 19:35:33', NULL, '2010-08-19 19:35:33', NULL)
---
	def create
		@category = Category.find(params[:category_id])
		@website = Website.find(params[:website_id])
		@categorization = Categorization.new()
		@categorization.category = @category
		@categorization.website = @website
		@categorization.move_to_bottom
		if @categorization.save

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "categorizations" WHERE ("categorizations"."id" = 13)
DELETE FROM "categorizations" WHERE "id" = 13
---
	def destroy
		@category = Category.find(params[:category_id])
		@categorization = Categorization.find(params[:id])
		@categorization.destroy