app/controllers/categories_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('Test Category', '2010-08-19 14:47:42', '2010-08-19 14:47:42')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "categories" SET "updated_at" = '2010-08-25 21:21:46', "name" = 'Test Category Mod' WHERE "id" = 1
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT * FROM "categories" WHERE ("categories"."id" = 5)
DELETE FROM "categories" WHERE "id" = 5
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy