app/controllers/categorizations_controller.rb

SELECT * FROM "categorizations" WHERE ("categorizations"."id" = 18)
---
	def edit
		@categorization = Categorization.find(params[:id])