app/controllers/websites_controller.rb

SELECT * FROM "websites"
---
  def index
    @websites = Website.all

SELECT * FROM "websites" WHERE ("websites"."id" = 1)
---
  def show
    @website = Website.find(params[:id])

SELECT * FROM "websites" WHERE ("websites"."id" = 2)
---
  def edit
    @website = Website.find(params[:id])

INSERT INTO "websites" ("created_at", "title", "updated_at", "challenge", "website", "features", "solution", "image", "launched", "industry") VALUES('2010-08-19 15:24:34', 'Test Title', '2010-08-19 15:24:34', '', '', '', '', '', '', '')
---
  def create
    @website = Website.new(params[:website])

    respond_to do |format|
      if @website.save

SELECT * FROM "websites" WHERE ("websites"."id" = 2)
UPDATE "websites" SET "updated_at" = '2010-08-31 21:04:46', "title" = 'Elaine Dame mod' WHERE "id" = 57
---
  def update
    @website = Website.find(params[:id])

    respond_to do |format|
      if @website.update_attributes(params[:website])

SELECT * FROM "websites" WHERE ("websites"."id" = 4)
DELETE FROM "websites" WHERE "id" = 4
---
  def destroy
    @website = Website.find(params[:id])
    @website.destroy